### Списки:

# 1. **Робота із списками:**
#    Завдання: Створіть список чисел. Додайте до списку числа 10 і 20, видаліть число 10 і виведіть отриманий список.

# number_list = [1,2,3,4]
# number_list.append(10)
# number_list.append(20)
# print(number_list)
# number_list.pop(4)
# print(number_list)


# 2. **Знаходження суми:**
#    Завдання: Створіть список чисел. Знайдіть та виведіть суму всіх чисел у списку.

# number_list = [1,2,3,4,5,10]
# total_sum = sum(number_list)
# print(total_sum)


# 3. **Подвійні значення:**
#    Завдання: Створіть список чисел. Подвойте кожне число у списку та виведіть результат.

# number_list = [1,2,3,4,5,10]
# doubled_numbers = []
# for number in number_list:
#     doubled_numbers.append(number * 2)
# print("Подвоєні числа:", doubled_numbers)

# ### Кортежі:

# 1. **Робота із кортежами:**
#    Завдання: Створіть кортеж з трьох різних предметів, таких як ("яблуко", "банан", "апельсин"). Виведіть кожен елемент кортежу окремо.

# fruits = ("яблуко", "банан", "апельсин")

# for fruit in fruits:
#     print(fruit)

# print(fruits[0])
# print(fruits[1])
# print(fruits[2])

# 2. **Об'єднання кортежів:**
#    Завдання: Створіть два кортежі з числами і об'єднайте їх у новий кортеж. Виведіть отриманий кортеж.

# num_1 = [1,2,3,4,5,10]
# num_2 = [5,6,8,7,9]
# tuple_1 = tuple(num_1)
# tuple_2 = tuple(num_2)
# total = tuple_1 + tuple_2
# sorted_total = tuple(sorted(total))
# print(sorted_total)

# ### Словники:

# 1. **Робота із словниками:**
#    Завдання: Створіть словник, що містить інформацію про вашого улюбленого спортсмена (ім'я, вік, спорт, команда тощо). Виведіть цю інформацію на екран.

# favorite_athlete = {
#     "ім'я": "Олександр Усик",
#     "вік": 37,
#     "спорт": "бокс",
#     "вагова категорія": "суперважка",
#     "країна": "Україна"
# }
# print(favorite_athlete)
# for key, value in favorite_athlete.items():
#     print(f"{key.capitalize()}: {value}")


# 2. **Оновлення словника:**
#    Завдання: Створіть словник, що містить ваші улюблені книги (назва книги та рік видання). Додайте до словника нову улюблену книгу та виведіть оновлений словник.

# favorite_books = {
#     "Інферно": 2013,
#     "Шерлок Холмс: Етюд у багряних тонах": 1887,
#     "Гра престолів": 1996
# }
# favorite_books["Мавка"] = 1967
# print(favorite_books)
# for title, year in favorite_books.items():
#     print(f"Назва: {title}, Рік видання: {year}")

# 3. **Пошук значення:**
#    Завдання: Створіть словник, що містить інформацію про країни та їх столиці. Запитайте користувача про назву країни і виведіть столицю цієї країни (якщо така країна є у словнику).

# countries_and_capitals = {
#     "Україна": "Київ",
#     "Франція": "Париж",
#     "Німеччина": "Берлін",
#     "Італія": "Рим",
#     "Японія": "Токіо",
#     "США": "Вашингтон"
# }
# for country, capital in countries_and_capitals.items():
#     print(f"Країна: {country}, Столиця: {capital}")
